{
  "experience": [
    {
      "companyName": "Irdeto",
      "positionName": "Jr. Software Developer",
      "companyLink": "https://irdeto.com/",
      "startDate": "September 2020",
      "endDate": "September 2021",
      "tools": [
        "HTML",
        "CSS",
        "JavaScript",
        "Python",
        "Selenium",
        "React",
        "Redux",
        "SASS",
        "Django",
        "MySQL",
        "Docker",
        "Chrome Extension API",
        "AWS",
        "Git"
      ],
      "jobDetails": [
        "Created and maintained Python scripts that supported Irdeto's scalable, cloud-based automated crawling technology, which combatted illegal video on demand content streams and live events.",
        "Maintained Irdeto's internal app that managed the profile scripts used to crawl for the online infringing content.",
        "Added new features to our internal app, such as search by domain and UI front end additions. This made it easier for our developers and analysts to search and view specific profiles responsible for tracking infringing content.",
        "Contributed to a team built Google Chrome extension that automated manual form entry and reduced the strain for analysts to send DMCA take down notices.",
        "Hosted the discovery team's retrospective meetings to analyze methods to improve overall productivity for each of our sprint cycles."
      ]
    },
    {
      "companyName": "moovez",
      "positionName": "Software Developer Intern",
      "companyLink": "https://www.linkedin.com/company/moovez/",
      "startDate": "May 2020",
      "endDate": "August 2020",
      "tools": [
        "HTML",
        "CSS",
        "JavaScript",
        "jQuery",
        "Bootstrap",
        "Figma",
        "Affinity Photo"
      ],
      "jobDetails": [
        "Converted our designer created advertising pages Figma to HTML, CSS, and JavaScript to influence potential customers to use our delivery services.",
        "Executed manual web testing using multiple browsers, desktops, and smartphones to ensure web pages were responsive and compatible across different browsers and devices.",
        "Performed system testing on our web app to improve the functionality and usability of the app."
      ]
    }
  ]
}
